<?php

/**
 * Translation file for Bulgarian language.
 */
return array(
	'yearly' => array(
		'1' => 'годишно',
		'else' => 'на всеки %{interval} години'
	),
	'monthly' => array(
		'1' => 'месечно',
		'else' => 'на всеки %{interval} месеца'
	),
	'weekly' => array(
		'1' => 'седмично',
		'2' => 'на всеки две седмици',
		'else' => 'на всеки %{interval} седмици'
	),
	'daily' => array(
		'1' => 'ежедневно',
		'2' => 'на всеки два дни',
		'else' => 'на всеки %{interval} дни'
	),
	'hourly' => array(
		'1' => 'на всеки час',
		'else' => 'на всеки %{interval} часа'
	),
	'minutely' => array(
		'1' => 'на всяка минута',
		'else' => 'на всеки %{interval} минути'
	),
	'secondly' => array(
		'1' => 'на всяка секунда',
		'else' => 'на всеки %{interval} секунди'
	),
	'dtstart' => ', започвайки от %{date}',
	'timeofday' => ' в %{date}',
	'startingtimeofday' => ' започвайки в %{date}',
	'infinite' => ', завинаги',
	'until' => ', до %{date}',
	'count' => array(
		'1' => ', веднъж',
		'else' => ', %{count} пъти'
	),
	'and' => 'и ',
	'x_of_the_y' => array(
		'yearly' => '%{x} от годината',
		'monthly' => '%{x} от месеца',
	),
	'bymonth' => ' през %{months}',
	'months' => array(
		1 => 'януари',
		2 => 'февруари',
		3 => 'март',
		4 => 'април',
		5 => 'май',
		6 => 'юни',
		7 => 'юли',
		8 => 'август',
		9 => 'септември',
		10 => 'октомври',
		11 => 'ноември',
		12 => 'декември',
	),
	'byweekday' => ' в %{weekdays}',
	'weekdays' => array(
		1 => 'понеделник',
		2 => 'вторник',
		3 => 'сряда',
		4 => 'четвъртък',
		5 => 'петък',
		6 => 'събота',
		7 => 'неделя',
	),
	'nth_weekday' => array(
		'1' => 'първия %{weekday}',
		'2' => 'втория %{weekday}',
		'3' => 'третия %{weekday}',
		'else' => '%{n}-тия %{weekday}'
	),
	'-nth_weekday' => array(
		'-1' => 'последния %{weekday}',
		'-2' => 'предпоследния %{weekday}',
		'-3' => 'предпредпоследния %{weekday}',
		'else' => '%{n}-тия от края %{weekday}'
	),
	'byweekno' => array(
		'1' => ' през седмица %{weeks}',
		'else' => ' през седмици номер %{weeks}'
	),
	'nth_weekno' => '%{n}',
	'bymonthday' => ' на %{monthdays}',
	'nth_monthday' => array(
		'1' => 'първия',
		'2' => 'втория',
		'3' => 'третия',
		'21' => 'двадесет и първия',
		'22' => 'двадесет и втория',
		'23' => 'двадесет и третия',
		'31' => 'тридесет и първия',
		'else' => '%{n}-тия'
	),
	'-nth_monthday' => array(
		'-1' => 'последния ден',
		'-2' => 'предпоследния ден',
		'-3' => 'предпредпоследния ден',
		'-21' => 'двадесет и първия ден от края',
		'-22' => 'двадесет и втория ден от края',
		'-23' => 'двадесет и третия ден от края',
		'-31' => 'тридесет и първия ден от края',
		'else' => '%{n}-тия ден от края'
	),
	'byyearday' => array(
		'1' => ' на %{yeardays} ден',
		'else' => ' на %{yeardays} дни'
	),
	'nth_yearday' => array(
		'1' => 'първия',
		'2' => 'втория',
		'3' => 'третия',
		'else' => '%{n}-тия'
	),
	'-nth_yearday' => array(
		'-1' => 'последния',
		'-2' => 'предпоследния',
		'-3' => 'предпредпоследния',
		'else' => '%{n}-тия от края'
	),
	'byhour' => array(
		'1' => ' в %{hours}',
		'else' => ' в %{hours}'
	),
	'nth_hour' => '%{n}ч',
	'byminute' => array(
		'1' => ' в минута %{minutes}',
		'else' => ' в минути %{minutes}'
	),
	'nth_minute' => '%{n}',
	'bysecond' => array(
		'1' => ' в секунда %{seconds}',
		'else' => ' в секунди %{seconds}'
	),
	'nth_second' => '%{n}',
	'bysetpos' => ', но само %{setpos} инстанция от този набор',
	'nth_setpos' => array(
		'1' => 'първата',
		'2' => 'втората',
		'3' => 'третата',
		'else' => '%{n}-тата'
	),
	'-nth_setpos' => array(
		'-1' => 'последната',
		'-2' => 'предпоследната',
		'-3' => 'предпредпоследната',
		'else' => '%{n}-тата от края'
	)
); 