<?php

/**
 * Translation file for Ukrainian language.
 */
return array(
	'yearly' => array(
		'1' => 'щорічно',
		'else' => 'кожні %{interval} роки'
	),
	'monthly' => array(
		'1' => 'щомісячно',
		'else' => 'кожні %{interval} місяці'
	),
	'weekly' => array(
		'1' => 'щотижня',
		'2' => 'кожні два тижні',
		'else' => 'кожні %{interval} тижні'
	),
	'daily' => array(
		'1' => 'щодня',
		'2' => 'кожні два дні',
		'else' => 'кожні %{interval} дні'
	),
	'hourly' => array(
		'1' => 'щогодини',
		'else' => 'кожні %{interval} години'
	),
	'minutely' => array(
		'1' => 'щохвилини',
		'else' => 'кожні %{interval} хвилини'
	),
	'secondly' => array(
		'1' => 'щосекунди',
		'else' => 'кожні %{interval} секунди'
	),
	'dtstart' => ', починаючи з %{date}',
	'timeofday' => ' о %{date}',
	'startingtimeofday' => ' починаючи о %{date}',
	'infinite' => ', назавжди',
	'until' => ', до %{date}',
	'count' => array(
		'1' => ', один раз',
		'else' => ', %{count} разів'
	),
	'and' => 'і ',
	'x_of_the_y' => array(
		'yearly' => '%{x} року',
		'monthly' => '%{x} місяця',
	),
	'bymonth' => ' у %{months}',
	'months' => array(
		1 => 'січні',
		2 => 'лютому',
		3 => 'березні',
		4 => 'квітні',
		5 => 'травні',
		6 => 'червні',
		7 => 'липні',
		8 => 'серпні',
		9 => 'вересні',
		10 => 'жовтні',
		11 => 'листопаді',
		12 => 'грудні',
	),
	'byweekday' => ' у %{weekdays}',
	'weekdays' => array(
		1 => 'понеділок',
		2 => 'вівторок',
		3 => 'середа',
		4 => 'четвер',
		5 => 'п\'ятниця',
		6 => 'субота',
		7 => 'неділя',
	),
	'nth_weekday' => array(
		'1' => 'перший %{weekday}',
		'2' => 'другий %{weekday}',
		'3' => 'третій %{weekday}',
		'else' => '%{n}-й %{weekday}'
	),
	'-nth_weekday' => array(
		'-1' => 'останній %{weekday}',
		'-2' => 'передостанній %{weekday}',
		'-3' => 'третій з кінця %{weekday}',
		'else' => '%{n}-й з кінця %{weekday}'
	),
	'byweekno' => array(
		'1' => ' у %{weeks} тижні',
		'else' => ' у тижнях %{weeks}'
	),
	'nth_weekno' => '%{n}',
	'bymonthday' => ' %{monthdays} числа',
	'nth_monthday' => array(
		'1' => 'перше',
		'2' => 'друге',
		'3' => 'третє',
		'21' => 'двадцять перше',
		'22' => 'двадцять друге',
		'23' => 'двадцять третє',
		'31' => 'тридцять перше',
		'else' => '%{n}-е'
	),
	'-nth_monthday' => array(
		'-1' => 'останній день',
		'-2' => 'передостанній день',
		'-3' => 'третій з кінця день',
		'-21' => 'двадцять перший з кінця день',
		'-22' => 'двадцять другий з кінця день',
		'-23' => 'двадцять третій з кінця день',
		'-31' => 'тридцять перший з кінця день',
		'else' => '%{n}-й з кінця день'
	),
	'byyearday' => array(
		'1' => ' %{yeardays} дня',
		'else' => ' у дні %{yeardays}'
	),
	'nth_yearday' => array(
		'1' => 'перший',
		'2' => 'другий',
		'3' => 'третій',
		'else' => '%{n}-й'
	),
	'-nth_yearday' => array(
		'-1' => 'останній',
		'-2' => 'передостанній',
		'-3' => 'третій з кінця',
		'else' => '%{n}-й з кінця'
	),
	'byhour' => array(
		'1' => ' о %{hours} годині',
		'else' => ' о %{hours} годинах'
	),
	'nth_hour' => '%{n}',
	'byminute' => array(
		'1' => ' о %{minutes} хвилині',
		'else' => ' о %{minutes} хвилинах'
	),
	'nth_minute' => '%{n}',
	'bysecond' => array(
		'1' => ' о %{seconds} секунді',
		'else' => ' о %{seconds} секундах'
	),
	'nth_second' => '%{n}',
	'bysetpos' => ', але тільки %{setpos} екземпляр цього набору',
	'nth_setpos' => array(
		'1' => 'перший',
		'2' => 'другий',
		'3' => 'третій',
		'else' => '%{n}-й'
	),
	'-nth_setpos' => array(
		'-1' => 'останній',
		'-2' => 'передостанній',
		'-3' => 'третій з кінця',
		'else' => '%{n}-й з кінця'
	)
); 